mohamed-amine-mighri/PQC_Communication/Nouman/stm32/FALCON_PADDED/BLE_p2pClient/STM32_WPAN/App/app_ble.c
          case ACI_HAL_END_OF_RADIO_ACTIVITY_VSEVT_CODE:
            {
              /* USER CODE BEGIN RADIO_ACTIVITY_EVENT */
              BSP_LED_On(LED_GREEN);
              HW_TS_Start(BleApplicationContext.SwitchOffGPIO_timer_Id, (uint32_t)LED_ON_TIMEOUT);
              /* USER CODE END RADIO_ACTIVITY_EVENT */
            }
            break; /* ACI_HAL_END_OF_RADIO_ACTIVITY_VSEVT_CODE */
  #endif

          /* USER CODE BEGIN BLUE_EVT */
          case ACI_ATT_EXCHANGE_MTU_RESP_VSEVT_CODE:
            {
              aci_att_exchange_mtu_resp_event_rp0 *mtu_evt = (void*) blecore_evt->data;
              APP_DBG_MSG("-- ATT MTU NEGOTIATED: %d bytes (usable payload: %d bytes)\n\r",
                          mtu_evt->Server_RX_MTU, mtu_evt->Server_RX_MTU - 3);

              /**
               * The MTU exchange GATT procedure has now completed, so it is
               * safe to start the next GATT client procedure (service
               * discovery). Starting it any earlier collides with the
               * MTU exchange still in progress and is rejected with
               * "Command Disallowed" (0x0C).
               */
              Start_Service_Discovery();
            }
            break;
          /* USER CODE END BLUE_EVT */

          default:
            /* USER CODE BEGIN ecode_default */

            /* USER CODE END ecode_default */
            break;
        }
      }
      break;

    case HCI_DISCONNECTION_COMPLETE_EVT_CODE:
      {
        /* USER CODE BEGIN EVT_DISCONN_COMPLETE */

        /* USER CODE END EVT_DISCONN_COMPLETE */
        if (cc->Connection_Handle == BleApplicationContext.BleApplicationContext_legacy.connectionHandle)
        {
          BleApplicationContext.BleApplicationContext_legacy.connectionHandle = 0;
          BleApplicationContext.Device_Connection_Status = APP_BLE_IDLE;
          APP_DBG_MSG("\r\n\r** DISCONNECTION EVENT WITH SERVER \n\r");
          handleNotification.P2P_Evt_Opcode = PEER_DISCON_HANDLE_EVT;
          handleNotification.ConnectionHandle = BleApplicationContext.BleApplicationContext_legacy.connectionHandle;
          P2PC_APP_Notification(&handleNotification);
        }
      }
      break; /* HCI_DISCONNECTION_COMPLETE_EVT_CODE */

    case HCI_LE_META_EVT_CODE:
      {
        /* USER CODE BEGIN EVT_LE_META_EVENT */

        /* USER CODE END EVT_LE_META_EVENT */
        meta_evt = (evt_le_meta_event*) event_pckt->data;

        switch (meta_evt->subevent)
        {
          /* USER CODE BEGIN subevent */

          /* USER CODE END subevent */

          case HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE:
            /* USER CODE BEGIN EVT_LE_CONN_COMPLETE */

            /* USER CODE END EVT_LE_CONN_COMPLETE */
            /**
             * The connection is done,
             */
            connection_complete_event = (hci_le_connection_complete_event_rp0 *) meta_evt->data;
            BleApplicationContext.BleApplicationContext_legacy.connectionHandle = connection_complete_event->Connection_Handle;
            BleApplicationContext.Device_Connection_Status = APP_BLE_CONNECTED_CLIENT;

            /* USER CODE BEGIN DLE_REQUEST */
            /**
             * Request Data Length Extension so the Link Layer uses larger
             * over-the-air packets (up to 251 bytes) instead of fragmenting
             * everything into legacy 27-byte packets.
             * connection_complete_event is valid here since it was just assigned above.
             * This is a controller-level HCI command, not a GATT client
             * procedure, so it does not collide with the GATT sequencing
             * below.
             */
            {
              tBleStatus dle_ret;
              dle_ret = hci_le_set_data_length(connection_complete_event->Connection_Handle, 251, 2120);
              if (dle_ret != BLE_STATUS_SUCCESS)
              {
                APP_DBG_MSG("  Fail   : hci_le_set_data_length command, result: 0x%x \n\r", dle_ret);
              }
              else
              {
                APP_DBG_MSG("  Success: hci_le_set_data_length command\n\r");
              }
            }
            /* USER CODE END DLE_REQUEST */

            /* CONNECTION WITH CLIENT */
            APP_DBG_MSG("\r\n\r**  CONNECTION COMPLETE EVENT WITH SERVER \n\r");
            handleNotification.P2P_Evt_Opcode = PEER_CONN_HANDLE_EVT;
            handleNotification.ConnectionHandle = BleApplicationContext.BleApplicationContext_legacy.connectionHandle;
            P2PC_APP_Notification(&handleNotification);

            /* USER CODE BEGIN MTU_EXCHANGE */
            /**
             * Request the ATT MTU exchange FIRST. Without this, both sides
             * stay at the legacy 23-byte MTU regardless of DLE /
             * CFG_BLE_MAX_ATT_MTU.
             *
             * IMPORTANT: aci_gatt_exchange_config() and
             * aci_gatt_disc_all_primary_services() are both asynchronous
             * GATT *client* procedures, and the stack only allows one
             * outstanding GATT client procedure per connection at a time.
             * Starting service discovery immediately after requesting the
             * MTU exchange (before the exchange has completed) gets
             * rejected with BLE_STATUS_FAILED / "Command Disallowed"
             * (0x0C). So we request the MTU exchange here, and only kick
             * off service discovery once ACI_ATT_EXCHANGE_MTU_RESP_VSEVT_CODE
             * confirms the exchange procedure has finished (see
             * Start_Service_Discovery() call in that event handler above).
             */
            {
              tBleStatus mtu_ret = aci_gatt_exchange_config(BleApplicationContext.BleApplicationContext_legacy.connectionHandle);
              if (mtu_ret != BLE_STATUS_SUCCESS)
              {
                APP_DBG_MSG("  Fail   : aci_gatt_exchange_config command, result: 0x%x \n\r", mtu_ret);
              }
              else
              {
                APP_DBG_MSG("  Success: aci_gatt_exchange_config command\n\r");
              }
            }
            /* USER CODE END MTU_EXCHANGE */

            /* NOTE: aci_gatt_disc_all_primary_services() is deliberately
             * NOT called here anymore. It is now triggered from
             * ACI_ATT_EXCHANGE_MTU_RESP_VSEVT_CODE via
             * Start_Service_Discovery(), once the MTU exchange procedure
             * has actually completed. */
            break; /* HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE */

